# String

## APPEND

**APPEND key value**

如果 `key` 已经存在并且是一个字符串， [APPEND](http://redisdoc.com/string/append.html#append) 命令将 `value` 追加到 `key` 原来的值的末尾。如果 `key` 不存在， [APPEND](http://redisdoc.com/string/append.html#append) 就简单地将给定 `key` 设为 `value` ，就像执行 `SET key value` 一样。

````shell
# 对不存在的 key 执行 APPEND

redis> EXISTS myphone               # 确保 myphone 不存在
(integer) 0

redis> APPEND myphone "nokia"       # 对不存在的 key 进行 APPEND ，等同于 SET myphone "nokia"
(integer) 5                         # 字符长度


# 对已存在的字符串进行 APPEND

redis> APPEND myphone " - 1110"     # 长度从 5 个字符增加到 12 个字符
(integer) 12

redis> GET myphone
"nokia - 1110"
````

### 模式：时间序列(Time series)](http://redisdoc.com/string/append.html#time-series)

[APPEND](http://redisdoc.com/string/append.html#append) 可以为一系列定长(fixed-size)数据(sample)提供一种紧凑的表示方式，通常称之为时间序列。

每当一个新数据到达的时候，执行以下命令：

```
APPEND timeseries "fixed-size sample"

```

然后可以通过以下的方式访问时间序列的各项属性：

- [STRLEN](http://redisdoc.com/string/strlen.html#strlen) 给出时间序列中数据的数量
- [GETRANGE](http://redisdoc.com/string/getrange.html#getrange) 可以用于随机访问。只要有相关的时间信息的话，我们就可以在 Redis 2.6 中使用 Lua 脚本和 [GETRANGE](http://redisdoc.com/string/getrange.html#getrange) 命令实现二分查找。
- [SETRANGE](http://redisdoc.com/string/setrange.html#setrange) 可以用于覆盖或修改已存在的的时间序列。

```shell
127.0.0.1:6379> APPEND ts '0043'
(integer) 4
127.0.0.1:6379> APPEND ts '0035'
(integer) 8
127.0.0.1:6379> STRLEN ts
(integer) 8
127.0.0.1:6379> GETRANGE ts 0 3
"0043"
127.0.0.1:6379> GETRANGE ts 2 6
"43003"
```

## BITCOUNT

**BITCOUNT key [start][end]**

计算给定字符串中，被设置为 `1` 的比特位的数量。

```shell
redis> BITCOUNT bits
(integer) 0

redis> SETBIT bits 0 1          # 0001
(integer) 0

redis> BITCOUNT bits
(integer) 1

redis> SETBIT bits 3 1          # 1001
(integer) 0

redis> BITCOUNT bits
(integer) 2
```

### [模式：使用 bitmap 实现用户上线次数统计](http://redisdoc.com/string/bitcount.html#bitmap)

就是每连续登录一天，字节**长度**+1

如果今天是网站上线的第 100 天，而用户 peter 在今天阅览过网站，那么执行命令 `SETBIT peter 100 1` ；如果明天 peter 也继续阅览网站，那么执行命令 `SETBIT peter 101 1` ，以此类推。

### [性能](http://redisdoc.com/string/bitcount.html#id2)

以上性能会非常优秀，但如果你的 bitmap 数据非常大，那么可以考虑使用以下两种方法：

1. 将一个大的 bitmap 分散到不同的 key 中，作为小的 bitmap 来处理。使用 Lua 脚本可以很方便地完成这一工作。
2. 使用 [BITCOUNT](http://redisdoc.com/string/bitcount.html#bitcount) 的 `start` 和 `end` 参数，每次只对所需的部分位进行计算，将位的累积工作(accumulating)放到客户端进行，并且对结果进行缓存 (caching)。

## [BITOP](http://redisdoc.com/string/bitop.html)

**BITOP operation destkey key [key ...]**

对一个或多个保存二进制位的字符串 `key` 进行位元操作，并将结果保存到 `destkey` 上。

`operation` 可以是 `AND` 、 `OR` 、 `NOT` 、 `XOR` 这四种操作中的任意一种：

- `BITOP AND destkey key [key ...]` ，对一个或多个 `key` 求逻辑并，并将结果保存到 `destkey` 。
- `BITOP OR destkey key [key ...]` ，对一个或多个 `key` 求逻辑或，并将结果保存到 `destkey` 。
- `BITOP XOR destkey key [key ...]` ，对一个或多个 `key` 求逻辑异或，并将结果保存到 `destkey` 。
- `BITOP NOT destkey key` ，对给定 `key` 求逻辑非，并将结果保存到 `destkey` 。

## BITFIELD

**BITFIELD key [GET type offset][SET type offset value] [INCRBY type offset increment][OVERFLOW WRAP|SAT|FAIL]**

`BITFIELD` 命令可以将一个 Redis 字符串看作是一个由二进制位组成的数组

### [支持的子命令以及数字类型](http://redisdoc.com/string/bitfield.html#id2)

### [二进制位和位置偏移量](http://redisdoc.com/string/bitfield.html#id3)

### [溢出控制](http://redisdoc.com/string/bitfield.html#id4)

### 作用](http://redisdoc.com/string/bitfield.html#id5)

### [性能注意事项](http://redisdoc.com/string/bitfield.html#id6)

### [二进制位的排列](http://redisdoc.com/string/bitfield.html#id7)

## [DECR](http://redisdoc.com/string/decr.html)

**DECR key**

将 `key` 中储存的数字值减一。

```shell
# 对存在的数字值 key 进行 DECR

redis> SET failure_times 10
OK

redis> DECR failure_times
(integer) 9


# 对不存在的 key 值进行 DECR

redis> EXISTS count
(integer) 0

redis> DECR count
(integer) -1


# 对存在但不是数值的 key 进行 DECR

redis> SET company YOUR_CODE_SUCKS.LLC
OK

redis> DECR company
(error) ERR value is not an integer or out of range
```

## [DECRBY](http://redisdoc.com/string/decrby.html)

**DECRBY key decrement**

将 `key` 所储存的值减去减量 `decrement` 。

````shell
# 对已存在的 key 进行 DECRBY

redis> SET count 100
OK

redis> DECRBY count 20
(integer) 80


# 对不存在的 key 进行DECRBY

redis> EXISTS pages
(integer) 0

redis> DECRBY pages 10
(integer) -10
````

## [GET](http://redisdoc.com/string/get.html)

**GET key**

返回 `key` 所关联的字符串值。如果 `key` 不存在那么返回特殊值 `nil` 。假如 `key` 储存的值不是字符串类型，返回一个错误，因为 [GET](http://redisdoc.com/string/get.html#get) 只能用于处理字符串值。

## [GETBIT](http://redisdoc.com/string/getbit.html)

**GETBIT key offset**

对 `key` 所储存的字符串值，获取指定偏移量上的位(bit)。

```shell
# 对不存在的 key 或者不存在的 offset 进行 GETBIT， 返回 0

redis> EXISTS bit
(integer) 0

redis> GETBIT bit 10086
(integer) 0


# 对已存在的 offset 进行 GETBIT

redis> SETBIT bit 10086 1
(integer) 0

redis> GETBIT bit 10086
(integer) 1
```

## [GETRANGE](http://redisdoc.com/string/getrange.html)

**GETRANGE key start end**

返回 `key` 中字符串值的子字符串，字符串的截取范围由 `start` 和 `end` 两个偏移量决定(包括 `start` 和 `end` 在内)

```shell
redis> SET greeting "hello, my friend"
OK

redis> GETRANGE greeting 0 4          # 返回索引0-4的字符，包括4。
"hello"

redis> GETRANGE greeting -1 -5        # 不支持回绕操作
""

redis> GETRANGE greeting -3 -1        # 负数索引
"end"

redis> GETRANGE greeting 0 -1         # 从第一个到最后一个
"hello, my friend"

redis> GETRANGE greeting 0 1008611    # 值域范围不超过实际字符串，超过部分自动被符略
"hello, my friend"
```

## GETSET

**GETSET key value**

将给定 `key` 的值设为 `value` ，并返回 `key` 的旧值(old value)。当 `key` 存在但不是字符串类型时，返回一个错误。

```shell
redis> GETSET db mongodb    # 没有旧值，返回 nil
(nil)

redis> GET db
"mongodb"

redis> GETSET db redis      # 返回旧值 mongodb
"mongodb"

redis> GET db
"redis"
```

### [模式](http://redisdoc.com/string/getset.html#id2)

[GETSET](http://redisdoc.com/string/getset.html#getset) 可以和 [INCR](http://redisdoc.com/string/incr.html#incr) 组合使用，实现一个有原子性(atomic)复位操作的计数器(counter)。

```shell
redis> INCR mycount
(integer) 11

redis> GETSET mycount 0  # 一个原子内完成 GET mycount 和 SET mycount 0 操作
"11"

redis> GET mycount       # 计数器被重置
"0"
```

## INCR

**INCR key**

将 `key` 中储存的数字值增一。

````shell
redis> SET page_view 20
OK

redis> INCR page_view
(integer) 21

redis> GET page_view    # 数字值在 Redis 中以字符串的形式保存
"21"
````

### [模式：计数器](http://redisdoc.com/string/incr.html#id2)

计数器是 Redis 的原子性自增操作可实现的最直观的模式了，它的想法相当简单：每当某个操作发生时，向 Redis 发送一个 [INCR](http://redisdoc.com/string/incr.html#incr) 命令。

可以用以下几种方式扩展这个简单的模式：

- 可以通过组合使用 [INCR](http://redisdoc.com/string/incr.html#incr) 和 [EXPIRE](http://redisdoc.com/key/expire.html#expire) ，来达到只在规定的生存时间内进行计数(counting)的目的。
- 客户端可以通过使用 [GETSET](http://redisdoc.com/string/getset.html#getset) 命令原子性地获取计数器的当前值并将计数器清零，更多信息请参考 [GETSET](http://redisdoc.com/string/getset.html#getset) 命令。
- 使用其他自增/自减操作，比如 [DECR](http://redisdoc.com/string/decr.html#decr) 和 [INCRBY](http://redisdoc.com/string/incrby.html#incrby) ，用户可以通过执行不同的操作增加或减少计数器的值，比如在游戏中的记分器就可能用到这些命令。

### [模式：限速器](http://redisdoc.com/string/incr.html#id3)

限速器是特殊化的计算器，它用于限制一个操作可以被执行的速率(rate)。

## [INCRBY](http://redisdoc.com/string/incrby.html)

**INCRBY key increment**

将 `key` 所储存的值加上增量 `increment` 。

```shell
# key 存在且是数字值

redis> SET rank 50
OK

redis> INCRBY rank 20
(integer) 70

redis> GET rank
"70"


# key 不存在时

redis> EXISTS counter
(integer) 0

redis> INCRBY counter 30
(integer) 30

redis> GET counter
"30"


# key 不是数字值时

redis> SET book "long long ago..."
OK

redis> INCRBY book 200
(error) ERR value is not an integer or out of range
```

## [INCRBYFLOAT](http://redisdoc.com/string/incrbyfloat.html)

**INCRBYFLOAT key increment**

为 `key` 中所储存的值加上浮点数增量 `increment` 。

## [MGET](http://redisdoc.com/string/mget.html)

**MGET key [key ...]**

返回所有(一个或多个)给定 `key` 的值。

## [MSET](http://redisdoc.com/string/mset.html)

**MSET key value [key value ...]**

同时设置一个或多个 `key-value` 对。

## [MSETNX](http://redisdoc.com/string/msetnx.html)

**MSETNX key value [key value ...]**

同时设置一个或多个 `key-value` 对，当且仅当所有给定 `key` 都不存在。

## [PSETEX](http://redisdoc.com/string/psetex.html)

**PSETEX key milliseconds value**

这个命令和 [SETEX](http://redisdoc.com/string/setex.html#setex) 命令相似，但它以毫秒为单位设置 `key` 的生存时间，而不是像 [SETEX](http://redisdoc.com/string/setex.html#setex) 命令那样，以秒为单位。

```shell
redis> PSETEX mykey 1000 "Hello"
OK

redis> PTTL mykey
(integer) 999

redis> GET mykey
"Hello"
```

## SET

**SET key value [EX seconds][PX milliseconds] [NX|XX]**

将字符串值 `value` 关联到 `key` 。

- `EX second` ：设置键的过期时间为 `second` 秒。 `SET key value EX second` 效果等同于 `SETEX key second value` 
- `PX millisecond` ：设置键的过期时间为 `millisecond` 毫秒。 `SET key value PX millisecond` 效果等同于 `PSETEX key millisecond value` 
- `NX` ：只在键不存在时，才对键进行设置操作。 `SET key value NX` 效果等同于 `SETNX key value` 
- `XX` ：只在键已经存在时，才对键进行设置操作

### [使用模式](http://redisdoc.com/string/set.html#id2)

命令 `SET resource-name anystring NX EX max-lock-time` 是一种在 Redis 中实现锁的简单方法。

- 如果服务器返回 `OK` ，那么这个客户端获得锁。
- 如果服务器返回 `NIL` ，那么客户端获取锁失败，可以在稍后再重试。



## [SETBIT](http://redisdoc.com/string/setbit.html)

**SETBIT key offset value**

对 `key` 所储存的字符串值，设置或清除指定偏移量上的位(bit)。

````javascript
redis> SETBIT bit 10086 1
(integer) 0

redis> GETBIT bit 10086
(integer) 1

redis> GETBIT bit 100   # bit 默认被初始化为 0
(integer) 0
````

## [SETEX](http://redisdoc.com/string/setex.html)

**SETEX key seconds value**

将值 `value` 关联到 `key` ，并将 `key` 的生存时间设为 `seconds` (以秒为单位)。

```shell
# 在 key 不存在时进行 SETEX

redis> SETEX cache_user_id 60 10086
OK

redis> GET cache_user_id  # 值
"10086"

redis> TTL cache_user_id  # 剩余生存时间
(integer) 49


# key 已经存在时，SETEX 覆盖旧值

redis> SET cd "timeless"
OK

redis> SETEX cd 3000 "goodbye my love"
OK

redis> GET cd
"goodbye my love"

redis> TTL cd
(integer) 2997
```

## [SETNX](http://redisdoc.com/string/setnx.html)

**SETNX key value**

将 `key` 的值设为 `value` ，当且仅当 `key` 不存在。

```shell
redis> EXISTS job                # job 不存在
(integer) 0

redis> SETNX job "programmer"    # job 设置成功
(integer) 1

redis> SETNX job "code-farmer"   # 尝试覆盖 job ，失败
(integer) 0

redis> GET job                   # 没有被覆盖
"programmer"
```

## SETRANGE

**SETRANGE key offset value**

用 `value` 参数覆写(overwrite)给定 `key` 所储存的字符串值，从偏移量 `offset` 开始。

```shell
# 对非空字符串进行 SETRANGE

redis> SET greeting "hello world"
OK

redis> SETRANGE greeting 6 "Redis"
(integer) 11

redis> GET greeting
"hello Redis"


# 对空字符串/不存在的 key 进行 SETRANGE

redis> EXISTS empty_string
(integer) 0

redis> SETRANGE empty_string 5 "Redis!"   # 对不存在的 key 使用 SETRANGE
(integer) 11

redis> GET empty_string                   # 空白处被"\x00"填充
"\x00\x00\x00\x00\x00Redis!"
```

### [模式](http://redisdoc.com/string/setrange.html#id2)

因为有了 [SETRANGE](http://redisdoc.com/string/setrange.html#setrange) 和 [GETRANGE](http://redisdoc.com/string/getrange.html#getrange) 命令，你可以将 Redis 字符串用作具有O(1)随机访问时间的线性数组，这在很多真实用例中都是非常快速且高效的储存方式，具体请参考 [APPEND](http://redisdoc.com/string/append.html#append) 命令的『模式：时间序列』部分。

## [STRLEN](http://redisdoc.com/string/strlen.html)

**STRLEN key**

返回 `key` 所储存的字符串值的长度。

```shell
# 获取字符串的长度

redis> SET mykey "Hello world"
OK

redis> STRLEN mykey
(integer) 11


# 不存在的 key 长度为 0

redis> STRLEN nonexisting
(integer) 0
```

