# list(列表)

## BLPOP

**BLPOP key [key ...] timeout**

[BLPOP](http://redisdoc.com/list/blpop.html#blpop) 是列表的阻塞式(blocking)弹出原语。它是 [LPOP](http://redisdoc.com/list/lpop.html#lpop) 命令的阻塞版本，当给定列表内没有任何元素可供弹出的时候，连接将被 [BLPOP](http://redisdoc.com/list/blpop.html#blpop) 命令阻塞，直到等待超时或发现可弹出元素为止。当存在多个给定 `key` 时， [BLPOP](http://redisdoc.com/list/blpop.html#blpop) 按给定 `key` 参数排列的先后顺序，依次检查各个列表。

**使用事务**

```javascript
# 对非空列表进行操作

redis> RPUSH job programming
(integer) 1

redis> MULTI
OK

redis> BLPOP job 30
QUEUED

redis> EXEC           # 不阻塞，立即返回
1) 1) "job"
   2) "programming"


# 对空列表进行操作

redis> LLEN job      # 空列表
(integer) 0

redis> MULTI
OK

redis> BLPOP job 30
QUEUED

redis> EXEC         # 不阻塞，立即返回
1) (nil)
```

### [模式：事件提醒](http://redisdoc.com/list/blpop.html#id2)

## [BRPOP](http://redisdoc.com/list/brpop.html)

**BRPOP key [key ...] timeout**

[BRPOP](http://redisdoc.com/list/brpop.html#brpop) 是列表的阻塞式(blocking)弹出原语。它是 [RPOP](http://redisdoc.com/list/rpop.html#rpop) 命令的阻塞版本，当给定列表内没有任何元素可供弹出的时候，连接将被 [BRPOP](http://redisdoc.com/list/brpop.html#brpop) 命令阻塞，直到等待超时或发现可弹出元素为止。

```shell
127.0.0.1:6379> LLEN course
(integer) 0
127.0.0.1:6379> RPUSH course algorithm001
(integer) 1
127.0.0.1:6379> RPUSH course c++101
(integer) 2
127.0.0.1:6379> BRpop course 30
1) "course"
2) "c++101"
```

## BRPOPLPUSH

**BRPOPLPUSH source destination timeout**

[BRPOPLPUSH](http://redisdoc.com/list/brpoplpush.html#brpoplpush) 是 [RPOPLPUSH](http://redisdoc.com/list/rpoplpush.html#rpoplpush) 的阻塞版本，当给定列表 `source` 不为空时， [BRPOPLPUSH](http://redisdoc.com/list/brpoplpush.html#brpoplpush) 的表现和 [RPOPLPUSH](http://redisdoc.com/list/rpoplpush.html#rpoplpush) 一样。

```shell
# 非空列表

redis> BRPOPLPUSH msg reciver 500
"hello moto"                        # 弹出元素的值
(3.38s)                             # 等待时长

redis> LLEN reciver
(integer) 1

redis> LRANGE reciver 0 0
1) "hello moto"


# 空列表

redis> BRPOPLPUSH msg reciver 1
(nil)
```

## [LINDEX](http://redisdoc.com/list/lindex.html)

**LINDEX key index**

返回列表 `key` 中，下标为 `index` 的元素。

```shell
redis> LPUSH mylist "World"
(integer) 1

redis> LPUSH mylist "Hello"
(integer) 2

redis> LINDEX mylist 0
"Hello"

redis> LINDEX mylist -1
"World"
```

## [LINSERT](http://redisdoc.com/list/linsert.html)

**LINSERT key BEFORE|AFTER pivot value**

将值 `value` 插入到列表 `key` 当中，位于值 `pivot` 之前或之后。当 `pivot` 不存在于列表 `key` 时，不执行任何操作。当 `key` 不存在时， `key` 被视为空列表，不执行任何操作。如果 `key` 不是列表类型，返回一个错误。

```shell
redis> RPUSH mylist "Hello"
(integer) 1

redis> RPUSH mylist "World"
(integer) 2

redis> LINSERT mylist BEFORE "World" "There"
(integer) 3

redis> LRANGE mylist 0 -1
1) "Hello"
2) "There"
3) "World"


# 对一个非空列表插入，查找一个不存在的 pivot

redis> LINSERT mylist BEFORE "go" "let's"
(integer) -1                                    # 失败


# 对一个空列表执行 LINSERT 命令

redis> EXISTS fake_list
(integer) 0

redis> LINSERT fake_list BEFORE "nono" "gogogog"
(integer) 0                                      # 失败
```

## [LLEN](http://redisdoc.com/list/llen.html)

**LLEN key**

返回列表 `key` 的长度。如果 `key` 不存在，则 `key` 被解释为一个空列表，返回 `0` .

## [LPOP](http://redisdoc.com/list/lpop.html)

**LPOP key**

移除并返回列表 `key` 的头部元素。

## [LPUSH](http://redisdoc.com/list/lpush.html)

**LPUSH key value [value ...]**

将一个或多个值 `value` 插入到列表 `key` 的表头，不存在就创建

```javascript
# 加入单个元素

redis> LPUSH languages python
(integer) 1


# 加入重复元素

redis> LPUSH languages python
(integer) 2

redis> LRANGE languages 0 -1     # 列表允许重复元素
1) "python"
2) "python"


# 加入多个元素

redis> LPUSH mylist a b c
(integer) 3

redis> LRANGE mylist 0 -1
1) "c"
2) "b"
3) "a"
```

## [LPUSHX](http://redisdoc.com/list/lpushx.html)

**LPUSHX key value**

将值 `value` 插入到列表 `key` 的表头，当且仅当 `key` 存在并且是一个列表

## [LRANGE](http://redisdoc.com/list/lrange.html)

**LRANGE key start stop**

返回列表 `key` 中指定区间内的元素，区间以偏移量 `start` 和 `stop` 指定。

```shell
redis> RPUSH fp-language lisp
(integer) 1

redis> LRANGE fp-language 0 0
1) "lisp"

redis> RPUSH fp-language scheme
(integer) 2

redis> LRANGE fp-language 0 1
1) "lisp"
2) "scheme"
```

## [LREM](http://redisdoc.com/list/lrem.html)

根据参数 `count` 的值，移除列表中与参数 `value` 相等的元素。

`count` 的值可以是以下几种：

- `count > 0` : 从表头开始向表尾搜索，移除与 `value` 相等的元素，数量为 `count` 。
- `count < 0` : 从表尾开始向表头搜索，移除与 `value` 相等的元素，数量为 `count` 的绝对值。
- `count = 0` : 移除表中所有与 `value` 相等的值。

```shell
# 先创建一个表，内容排列是
# morning hello morning helllo morning

redis> LPUSH greet "morning"
(integer) 1
redis> LPUSH greet "hello"
(integer) 2
redis> LPUSH greet "morning"
(integer) 3
redis> LPUSH greet "hello"
(integer) 4
redis> LPUSH greet "morning"
(integer) 5

redis> LRANGE greet 0 4         # 查看所有元素
1) "morning"
2) "hello"
3) "morning"
4) "hello"
5) "morning"

redis> LREM greet 2 morning     # 移除从表头到表尾，最先发现的两个 morning
(integer) 2                     # 两个元素被移除

redis> LLEN greet               # 还剩 3 个元素
(integer) 3

redis> LRANGE greet 0 2
1) "hello"
2) "hello"
3) "morning"

redis> LREM greet -1 morning    # 移除从表尾到表头，第一个 morning
(integer) 1

redis> LLEN greet               # 剩下两个元素
(integer) 2

redis> LRANGE greet 0 1
1) "hello"
2) "hello"

redis> LREM greet 0 hello      # 移除表中所有 hello
(integer) 2                    # 两个 hello 被移除

redis> LLEN greet
(integer) 0
```

## [LSET](http://redisdoc.com/list/lset.html)

**LSET key index value**

将列表 `key` 下标为 `index` 的元素的值设置为 `value` 。

## [LTRIM](http://redisdoc.com/list/ltrim.html)

**LTRIM key start stop**

对一个列表进行修剪(trim)，就是说，让列表只保留指定区间内的元素，不在指定区间之内的元素都将被删除。举个例子，执行命令 `LTRIM list 0 2` ，表示只保留列表 `list` 的前三个元素，其余元素全部删除。

```shell
# 情况 1： 常见情况， start 和 stop 都在列表的索引范围之内

redis> LRANGE alpha 0 -1       # alpha 是一个包含 5 个字符串的列表
1) "h"
2) "e"
3) "l"
4) "l"
5) "o"

redis> LTRIM alpha 1 -1        # 删除 alpha 列表索引为 0 的元素
OK

redis> LRANGE alpha 0 -1       # "h" 被删除了
1) "e"
2) "l"
3) "l"
4) "o"


# 情况 2： stop 比列表的最大下标还要大


redis> LTRIM alpha 1 10086     # 保留 alpha 列表索引 1 至索引 10086 上的元素
OK

redis> LRANGE alpha 0 -1       # 只有索引 0 上的元素 "e" 被删除了，其他元素还在
1) "l"
2) "l"
3) "o"


# 情况 3： start 和 stop 都比列表的最大下标要大，并且 start < stop

redis> LTRIM alpha 10086 123321
OK

redis> LRANGE alpha 0 -1        # 列表被清空
(empty list or set)


# 情况 4： start 和 stop 都比列表的最大下标要大，并且 start > stop

redis> RPUSH new-alpha "h" "e" "l" "l" "o"     # 重新建立一个新列表
(integer) 5

redis> LRANGE new-alpha 0 -1
1) "h"
2) "e"
3) "l"
4) "l"
5) "o"

redis> LTRIM new-alpha 123321 10086    # 执行 LTRIM
OK

redis> LRANGE new-alpha 0 -1           # 同样被清空
(empty list or set)
```

## [RPOP](http://redisdoc.com/list/rpop.html)

**RPOP key**

移除并返回列表 `key` 的尾元素。

## RPOPLPUSH

**RPOPLPUSH source destination**

命令 [RPOPLPUSH](http://redisdoc.com/list/rpoplpush.html#rpoplpush) 在一个原子时间内，执行以下两个动作：

- 将列表 `source` 中的最后一个元素(尾元素)弹出，并返回给客户端。
- 将 `source` 弹出的元素插入到列表 `destination` ，作为 `destination` 列表的的头元素。

```shell
# source 和 destination 不同

redis> LRANGE alpha 0 -1         # 查看所有元素
1) "a"
2) "b"
3) "c"
4) "d"

redis> RPOPLPUSH alpha reciver   # 执行一次 RPOPLPUSH 看看
"d"

redis> LRANGE alpha 0 -1
1) "a"
2) "b"
3) "c"

redis> LRANGE reciver 0 -1
1) "d"

redis> RPOPLPUSH alpha reciver   # 再执行一次，证实 RPOP 和 LPUSH 的位置正确
"c"

redis> LRANGE alpha 0 -1
1) "a"
2) "b"

redis> LRANGE reciver 0 -1
1) "c"
2) "d"


# source 和 destination 相同

redis> LRANGE number 0 -1
1) "1"
2) "2"
3) "3"
4) "4"

redis> RPOPLPUSH number number
"4"

redis> LRANGE number 0 -1           # 4 被旋转到了表头
1) "4"
2) "1"
3) "2"
4) "3"

redis> RPOPLPUSH number number
"3"

redis> LRANGE number 0 -1           # 这次是 3 被旋转到了表头
1) "3"
2) "4"
3) "1"
4) "2"
```

### [模式： 安全的队列](http://redisdoc.com/list/rpoplpush.html#id2)

Redis的列表经常被用作队列(queue)，用于在不同程序之间有序地交换消息(message)。一个客户端通过 [LPUSH](http://redisdoc.com/list/lpush.html#lpush) 命令将消息放入队列中，而另一个客户端通过 [RPOP](http://redisdoc.com/list/rpop.html#rpop) 或者 [BRPOP](http://redisdoc.com/list/brpop.html#brpop) 命令取出队列中等待时间最长的消息。

### [模式：循环列表](http://redisdoc.com/list/rpoplpush.html#id3)

## [RPUSH](http://redisdoc.com/list/rpush.html)

**RPUSH key value [value ...]**

将一个或多个值 `value` 插入到列表 `key` 的表尾(最右边)。

## [RPUSHX](http://redisdoc.com/list/rpushx.html)

**RPUSHX key value**

将值 `value` 插入到列表 `key` 的表尾，当且仅当 `key` 存在并且是一个列表。